In [ ]:
import pandas as pd
df = pd.read_excel('RSC.xlsx')
df
del df['Status']
df
del df['unnamed1']
df

In [228]:
#Q1:Delete the empty columns (Status and unnamed1)

In [ ]:
#Q2: On the Gender Column, Replace the M and F to Male and Female Respectively
df
df['Gender'] =df['Gender'].str.replace('Malealeale',"Male")
df

df['Gender'] =df['Gender'].str.replace('Femaleemale',"Female")
df

In [ ]:
#Q3: On the Marital Status Column, replace 0 and 1 to Single and Married respectively
df['Marital_Status']= df['Marital_Status'].astype(str)
df['Marital_Status']= df['Marital_Status'].str.replace('0','Single')
df
df['Marital_Status']= df['Marital_Status'].str.replace('1','Married')
df

##### Some Orders were Unsuccessful i.e., incomplete. They are the ones with empty records in the Amount Columns.

In [ ]:
#Q4: Replace such empty cells with 0
df
df['Amount']=df['Amount'].fillna(0)
df.head(10)
dff=df
dff

### Using appropriate skill get the following information

In [ ]:
#Q5: Total number of Customers. Recall: Not Distinct; df['Cust_name'].count()
dff
dff['Cust_name'].nunique()

In [ ]:
#Sum of Orders by Occupation
dff
dff.pivot_table(index = "Occupation",
               values = "Orders",
              aggfunc = "sum")

In [ ]:
#To add Grand Total 
dff
dff.pivot_table(index = "Occupation",
               values = "Orders",
              aggfunc = "sum",
              margins = True,
    margins_name = 'Grand Total')

In [ ]:
#To sort by Occupation(A-Z)
t=dff.pivot_table(index = "Occupation",
               values = "Orders",
              aggfunc = "sum")
t.sort_values(by=['Occupation'], ascending = True)

In [ ]:
#To sort by Orders(H-L)
t=dff.pivot_table(index = "Occupation",
               values = "Orders",
              aggfunc = "sum")
t.sort_values(by=['Orders'], ascending = False)

In [ ]:
#Q6: What Occupation placed the highest numbers of Orders and by what Sum of Orders
Q6=dff.pivot_table(index = "Occupation",
               values = "Orders",
              aggfunc = "sum")

Q6.sort_values(by=['Orders'], ascending = False)

In [ ]:
#The Top 10 Product_Category by Sum of Amount 
S7=dff.pivot_table(index = "Product_Category",
               values = "Amount",
              aggfunc = "sum")

S7.sort_values(by=['Amount'], ascending = False).head(10)

In [ ]:
#Q7:The Top 10 Product_Category by Sum of Amount and the corresponding percentage of total
S7=dff.pivot_table(index = "Product_Category",
               values = "Amount",
              aggfunc = "sum")

S77=S7.sort_values(by=['Amount'], ascending = False).head(10)
S77["%"] = 100*S77['Amount']/S77['Amount'].sum()
S77.round(0)

In [ ]:
# Orders by Gender, Age Group 
dff.pivot_table(index = ['Gender', 'Age Group'],
               values = "Orders",
              aggfunc = "sum")

In [ ]:
#Q8 What Age Group of Male and Female respectively placed the highest number of Orders 
#Sort Within Group with Orders from Highest to Lowest
Q8=dff.pivot_table(index = ['Gender', 'Age Group'],
               values = "Orders",
              aggfunc = "sum")
Q8.sort_values(['Gender','Orders'],ascending = False).groupby('Gender').head()

In [310]:
#Q8 What Age Group of Male and Female respectively placed the highest number of Orders 
#Sort Within Group with Orders from Lowest to Highest
Q8=dff.pivot_table(index = ['Gender', 'Age Group'],
               values = "Orders",
              aggfunc = "sum")
Q8.sort_values(['Gender','Orders']).groupby('Gender').head()

                  Orders
Gender Age Group
Female 0-17          377
       55+           698
       51-55        1418
       46-50        1682
       18-25        3261
Male   0-17          313
       55+           379
       46-50         697
       51-55         698
       18-25        1389

In [ ]:
#Q9: What do you observe from your answer to Question 8
# The First three Group age are same for both Genders.

#### Q10: Sales by States across the Marital Status

In [312]:
Q10=dff.pivot_table(index = ['State'],
                   columns = ['Marital_Status'],
               values = "Amount",
              aggfunc = "sum",
                   margins = True,
    margins_name = 'Grand Total')

Q10.round(0)

Marital_Status       Married      Single  Grand Total
State
Andhra Pradesh     3304158.0   4732989.0    8037147.0
Bihar              1738712.0   2284045.0    4022757.0
Delhi              4895349.0   6708470.0   11603819.0
Gujarat            1500432.0   2445650.0    3946082.0
Haryana            1684843.0   2535332.0    4220175.0
Himachal Pradesh   2080988.0   2882380.0    4963368.0
Jharkhand          1302996.0   1723460.0    3026456.0
Karnataka          5717594.0   7805946.0   13523540.0
Kerala             1636445.0   2258047.0    3894492.0
Madhya Pradesh     3312371.0   4788771.0    8101142.0
Maharashtra        5890124.0   8537419.0   14427543.0
Punjab              682129.0    843671.0    1525800.0
Rajasthan           791429.0   1117980.0    1909409.0
Telangana           498873.0    652617.0    1151490.0
Uttar Pradesh      8158375.0  11216593.0   19374968.0
Uttarakhand         928928.0   1592016.0    2520944.0
Grand Total       44123746.0  62125386.0  106249132.0